posts/20230920-steamdeck-fun.html
<!DOCTYPE html>
<html lang="en">
<head>
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>./greg.out - SteamDeck Fun</title>
<meta name="author" content="Greg Silverstein" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" href="/me/css/style.css">
<link rel="icon" type="image/svg+xml" href="/me/favicon.svg">
<link rel="alternate" type="application/rss+xml" title="./greg.out" href="/me/index.xml">
<meta name="viewport" content="width=device-width, initial-scale=1">
</head>
<body>
<div id="preamble" class="status">
<header class="site-header"><div class="wrap"><div class="brand"><a class="logo" href="/me/">./greg.out</a><div class="subtitle">Greg Silverstein's Home on the internet</div></div><nav><a href="/me/">Home</a><a href="/me/about.html">About</a><a href="/me/resume.html">Resume</a><a href="/me/index.xml">RSS</a><a href="https://github.com/gsilvers">GitHub</a></nav></div></header><div class="wrap page-head"><h1 class="page-title">SteamDeck Fun</h1><div class="page-meta">2023-09-20</div></div>
</div>
<div id="content" class="content">
<section id="outline-container-steamdeck-fun" class="outline-2">
<h2 id="steamdeck-fun">SteamDeck Fun</h2>
<div class="outline-text-2" id="text-steamdeck-fun">
<p>
The steam deck really is a great device to poke around on. It's funky as someone with Linux experience, it is very open but it has some opinionated setup from Valve. For example it <a href="https://www.phoronix.com/review/steam-deck-steamos-linux">uses an A/B scheme</a> to roll back updates and this makes installing anything with Pamac/Pacman weird.
</p>

<p>
At the same point these things are kind of fun. It's a new cave to explore.
</p>
</div>
</section>
<section id="outline-container-steamdeck-as-an-adventure" class="outline-2">
<h2 id="steamdeck-as-an-adventure">SteamDeck as an adventure</h2>
<div class="outline-text-2" id="text-steamdeck-as-an-adventure">
<p>
Things like this make me wonder if a SteamDeck would be a better teaching tool than some of the things we commonly hand kids. Does a Chromebook or iPad ever teach you to dig in? An open but managed device like a SteamDeck lets you get in easily, the SteamOS is a polished console if you don't go under the surface.
</p>

<p>
While not free and not available to every child in the US or world as a whole a SteamDeck is close to that magic price point of $3-500 where educational institutions could use it. Likewise its close to that price point of the Nintendo Switch where it can be purchased for a child where an Xbox is a larger purchase.
</p>

<p>
You could imagine a sort of course plan structured to have a new learner go from gaming to learning computing to programming their own games. You hand them a switch, a USBC hub, a keyboard and a mouse and they could go through a chain.
</p>

<ol class="org-ol">
<li>Get deck, install a game</li>
<li>Play the game and tweak settings like TDP and frame rate to increase battery life.</li>
<li>Adjust the controls to make the game "yours".</li>
<li>Set up developer mode and go to the desktop.</li>
<li>Install an app like a music player.</li>
<li>Install a text editor (vs code, vim, Emacs).</li>
<li>Install Python</li>
<li>Python programming basics</li>
<li>Install Godot</li>
<li>Make a game and play it on the switch.</li>
</ol>

<p>
Imagine that instead of whatever happens on a Chromebook. Log in and YouTube?
</p>
</div>
</section>
<section id="outline-container-adventure-for-the-experienced" class="outline-2">
<h2 id="adventure-for-the-experienced">Adventure for the experienced</h2>
<div class="outline-text-2" id="text-adventure-for-the-experienced">
<p>
The SteamDeck is also great for the more experienced. Here's an example for myself, I always wish for something smaller than a laptop that I can take Emacs and my org agenda to go with.
</p>

<p>
I've gotten Emacs installed on my deck via flatpack. Doom Emacs doesn't seem to work with the deck out of the box, but who cares I'm hand rolling a config. The next best part? Using "add to steam" Emacs can be accessible from the Steam launcher.
</p>

<p>
From there I can remap the controller to have specific controls (say M-x Org Agenda) on the controller. I'm very close to being able to have my org agenda available on a portable touch screen device with no keyboard.
</p>

<p>
This project may sound awful to you, and that's fine, the point being the device enables such adventures.
</p>
</div>
</section>
<section id="outline-container-reach-out" class="outline-2">
<h2 id="reach-out">Reach Out</h2>
<div class="outline-text-2" id="text-reach-out">
<p>
You can reach out to me if you want to talk about this. I'd love to <a href="https://hachyderm.io/@pokeypoke">speak about it with anyone</a>.
</p>

<p>
Later!
</p>
</div>
</section>
</div>
<div id="postamble" class="status">
<footer class="site-footer"><div class="wrap">Written by Greg Silverstein &middot; theme <a href="https://github.com/protesilaos/ef-themes">ef-cherie</a> &middot; built with org-publish in GNU Emacs</div></footer>
</div>
</body>
</html>
